In [1]:
import mysql.connector

In [2]:
from tabulate import tabulate

In [3]:
conn = mysql.connector.connect(user='root',password='adi@1234',database='assignment')

In [4]:
mycursor = conn.cursor()

In [5]:
mycursor.execute("select * from assignment.workers")
myresult = mycursor.fetchall()

print(tabulate(myresult, headers=['Worker_id', 'FirstName', 'SecondName', 'City', 'Email', 'Dept', 'Salary', 'JoiningDate'], tablefmt='psql'))

+-------------+-------------+--------------+----------+--------------------+---------+----------+---------------------+
|   Worker_id | FirstName   | SecondName   | City     | Email              | Dept    |   Salary | JoiningDate         |
|-------------+-------------+--------------+----------+--------------------+---------+----------+---------------------|
|           1 | Akash       | Malik        | Delhi    | akash123@gmail.com | HR      |    45000 | 2021-02-20 09:00:00 |
|           2 | Aka         | Ma           | Noida    | aka@gmail.com      | Admin   |    30000 | 2021-06-01 09:00:00 |
|           3 | Jay         | Singh        | Delhi    | jay@gmail.com      | Admin   |    45000 | 2022-01-15 09:00:00 |
|           4 | Ankita      | Jain         | Gurugram | anki@gmail.com     | Account |    40000 | 2022-02-20 09:00:00 |
|           5 | Pooja       | Patil        | Delhi    | pooja@gmail.com    | IT      |    40000 | 2022-02-01 09:00:00 |
|           6 | Anju        | Tomar        | Noida    | anju@gmail.com     | HR      |    45000 | 2022-04-10 09:00:00 |
|           7 | Kaira       | Singh        | Delhi    | kaira@gmail.com    | Account |    30000 | 2022-02-20 09:00:00 |
+-------------+-------------+--------------+----------+--------------------+---------+----------+---------------------+

In [6]:
mycursor.execute("CREATE TABLE assignment.worker_dup AS SELECT * FROM assignment.workers")

In [7]:
mycursor.execute("select * from worker_dup")
myresult = mycursor.fetchall()

print(tabulate(myresult, headers=['Worker_id', 'FirstName', 'SecondName', 'City', 'Email', 'Dept', 'Salary', 'JoiningDate'], tablefmt='psql'))

+-------------+-------------+--------------+----------+--------------------+---------+----------+---------------------+
|   Worker_id | FirstName   | SecondName   | City     | Email              | Dept    |   Salary | JoiningDate         |
|-------------+-------------+--------------+----------+--------------------+---------+----------+---------------------|
|           1 | Akash       | Malik        | Delhi    | akash123@gmail.com | HR      |    45000 | 2021-02-20 09:00:00 |
|           2 | Aka         | Ma           | Noida    | aka@gmail.com      | Admin   |    30000 | 2021-06-01 09:00:00 |
|           3 | Jay         | Singh        | Delhi    | jay@gmail.com      | Admin   |    45000 | 2022-01-15 09:00:00 |
|           4 | Ankita      | Jain         | Gurugram | anki@gmail.com     | Account |    40000 | 2022-02-20 09:00:00 |
|           5 | Pooja       | Patil        | Delhi    | pooja@gmail.com    | IT      |    40000 | 2022-02-01 09:00:00 |
|           6 | Anju        | Tomar        | Noida    | anju@gmail.com     | HR      |    45000 | 2022-04-10 09:00:00 |
|           7 | Kaira       | Singh        | Delhi    | kaira@gmail.com    | Account |    30000 | 2022-02-20 09:00:00 |
+-------------+-------------+--------------+----------+--------------------+---------+----------+---------------------+

Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [8]:
mycursor.execute("select substr(First_name,1,3) from worker_dup")
myresult = mycursor.fetchall()

print(tabulate(myresult, headers=['FirstName'], tablefmt='psql'))

+-------------+
| FirstName   |
|-------------|
| Aka         |
| Aka         |
| Jay         |
| Ank         |
| Poo         |
| Anj         |
| Kai         |
+-------------+

In [9]:
q = """insert into worker_dup (worker_id, First_name, Last_name, Address, Email, Department, Salary, Joining_date)
values (8, "Amitabh", "Singh", "Gurugram", "amit@gmail.com", "HR", 50000, '22-02-01 09.00.00')"""

mycursor.execute(q)

 Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [10]:
q = """ select position('a' in First_name) from worker_dup where First_name="Amitabh" """
mycursor.execute(q)
myresult = mycursor.fetchall()

print(tabulate(myresult, headers=['FirstName'], tablefmt='psql'))

+-------------+
|   FirstName |
|-------------|
|           1 |
+-------------+

Q-3. Write an SQL query to print the name of employees having the highest salary in each department.

In [11]:
mycursor.execute("select First_name, Department, Salary from worker_dup where (Department, Salary) in (SELECT Department, MAX(Salary) from worker_dup group by Department);")
myresult = mycursor.fetchall()

print(tabulate(myresult, headers=['FirstName', 'Department', 'Salary'], tablefmt='psql'))

+-------------+--------------+----------+
| FirstName   | Department   |   Salary |
|-------------+--------------+----------|
| Jay         | Admin        |    45000 |
| Ankita      | Account      |    40000 |
| Pooja       | IT           |    40000 |
| Amitabh     | HR           |    50000 |
+-------------+--------------+----------+

In [12]:
mycursor.execute("drop table assignment.worker_dup")

In [13]:
mycursor.close()
conn.close()